In [1]:
people = {
    "first" : ["Anurag", "John", "Jake"],
    "last" : ["Timilsina", "Doe", "Doe"],
    "email" : ["anurag.timilsina@gmail.com", "JohnDoe@gmail.com", "JakeDoe@gmail.com"],
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first       last                       email
0  Anurag  Timilsina  anurag.timilsina@gmail.com
1    John        Doe           JohnDoe@gmail.com
2    Jake        Doe           JakeDoe@gmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ["first_name", "last_name", "email"]

In [7]:
df

  first_name  last_name                       email
0     Anurag  Timilsina  anurag.timilsina@gmail.com
1       John        Doe           JohnDoe@gmail.com
2       Jake        Doe           JakeDoe@gmail.com

In [8]:
df.columns = [x.upper() for x in df.columns]

In [9]:
df

  FIRST_NAME  LAST_NAME                       EMAIL
0     Anurag  Timilsina  anurag.timilsina@gmail.com
1       John        Doe           JohnDoe@gmail.com
2       Jake        Doe           JakeDoe@gmail.com

In [10]:
df.columns = df.columns.str.replace(' ','_')

In [11]:
df

  FIRST_NAME  LAST_NAME                       EMAIL
0     Anurag  Timilsina  anurag.timilsina@gmail.com
1       John        Doe           JohnDoe@gmail.com
2       Jake        Doe           JakeDoe@gmail.com

In [12]:
df.columns = [x.lower() for x in df.columns]
df

  first_name  last_name                       email
0     Anurag  Timilsina  anurag.timilsina@gmail.com
1       John        Doe           JohnDoe@gmail.com
2       Jake        Doe           JakeDoe@gmail.com

In [14]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace = True)

In [15]:
df

    first       last                       email
0  Anurag  Timilsina  anurag.timilsina@gmail.com
1    John        Doe           JohnDoe@gmail.com
2    Jake        Doe           JakeDoe@gmail.com

In [16]:
df.loc[2,['last', 'email']] = ['Doe', 'JohnDoe@email.com']
df

    first       last                       email
0  Anurag  Timilsina  anurag.timilsina@gmail.com
1    John        Doe           JohnDoe@gmail.com
2    Jake        Doe           JohnDoe@email.com

In [21]:
filt = (df['last'] == 'Doe')
df.loc[filt, 'last'] == 'Don'

1    False
2    False
Name: last, dtype: bool

In [20]:
df

    first       last                       email
0  Anurag  Timilsina  anurag.timilsina@gmail.com
1    John        Doe           JohnDoe@gmail.com
2    Jake        Doe           JohnDoe@email.com

In [22]:
df['email'].apply(len)

0    26
1    17
2    17
Name: email, dtype: int64

In [23]:
def update_email(email):
    return email.upper()

In [25]:
df['email'].apply(update_email)

0    ANURAG.TIMILSINA@GMAIL.COM
1             JOHNDOE@GMAIL.COM
2             JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [26]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [27]:
df

    first       last                       email
0  Anurag  Timilsina  anurag.timilsina@gmail.com
1    John        Doe           johndoe@gmail.com
2    Jake        Doe           johndoe@email.com

In [28]:
df.applymap(len)

   first  last  email
0      6     9     26
1      4     3     17
2      4     3     17

In [29]:
df.applymap(str.lower)

    first       last                       email
0  anurag  timilsina  anurag.timilsina@gmail.com
1    john        doe           johndoe@gmail.com
2    jake        doe           johndoe@email.com

In [31]:
df['first'].map({'john':'Mary','jake':'Chris'})

0    NaN
1    NaN
2    NaN
Name: first, dtype: object